ror/railsdoc/app/controllers/blogs_controller.rb

  def index
    #checkLogin
	@title = "Manager Blogs"

	@blogsList = Blog.paginate(:page => params[:page],:per_page => 5).order('updated_at DESC')
---
SELECT "blogs".* FROM "blogs" ORDER BY updated_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "blogs"

  def edit
    if checkLogin
	  @title = "Edit Blog"

	  begin
		@blog = Blog.find(params[:id])
	  rescue ActiveRecord::RecordNotFound => e
		render(:text => "Not found")
	  end

	  @error = nil

	  unless params[:blog].nil?
		@updateBlog = Blog.update(params[:id],params.require(:blog).permit(:title,:content))
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "blogs" SET "title" = 'Thủ khoa 29 điểm mỗi sáng ăn cơm nguội muối vừng', "content" = 'Căn nhà nhỏ ở đường số 1, Q. Tân Bình (TP.HCM) thường ngày vắng vẻ nay bỗng dưng đông vui hẳn. Họ hàng kéo đến chúc mừng Hoàng Nam (cựu học sinh trường THPT chuyên Lê Hồng Phong) thành tân thủ khoa ĐH Bách khoa. Từ trong buồng bước ra, Nam bẽn lẽn: “Nhà không có internet nên gần đến chiều mẹ em nói em mới biết. Mẹ phấn khởi quá nên xin làm về sớm tiếp họ hàng đến chúc mừng. Em thì cũng rất vui, đến giờ vẫn bất ngờ”.

  def detail

	begin
      @blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", "1"]]