ror/railsdoc/app/controllers/blogs_controller.rb

  def index
    #checkLogin
	@title = "Manager Blogs"
	@blogsList = Blog.all
---
SELECT "blogs".* FROM "blogs" ORDER BY created_at DESC