ror/railsdoc/app/controllers/top_controller.rb

  def login
	@title = "Login"
	@user = params[:user]
	@error = nil
	if @user != nil
	  @user = Users.find_by_username_and_password(@user[:username],@user[:password])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'fdsafsaddfas' AND "users"."password" = 'ZmRzYWZhc2RmYXNkZg==