ror/railsdoc/app/controllers/users_controller.rb

  def index
    checkLogin
    @title = "Manager Users"
    @users = Users.all
---
SELECT "users".* FROM "users"

  def new
    checkLogin
    @title = "Create User"
    @user = params[:user]
    @error = nil

    unless @user.nil?
      @createUser = Users.create(params.require(:user).permit(:username,:fullname,:password,:password_confirmation))
---
INSERT INTO "users" ("fullname", "password", "username") VALUES (?, ?, ?)  [["fullname", "Admin Mulodo"], ["password", "bXVsb2RvYWRtaW4=\n"], ["username", "mulodoadmin"]]

  def edit

    if checkLogin
      @title = "Edit User"

      begin
        @user = Users.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 18]]

  def del

    if checkLogin
      @user = Users.find_by_id(params[:id])
      unless @user.nil?
        @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 27]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 17]]

  def search

    if checkLogin

      unless params[:key].nil?
        @users = Users.find(:all, :conditions => ["username LIKE ?","%" << params[:key] << "%"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 18]]